tutorials/multiphase/vofLPTSolver/ACCM_bubbleCol3D/system/makeFaceSet.setSet
faceSet finlet new boxToFace (-0.01925 -0.0001 -0.01925 )(0.01925  0.0001 0.01925 )
