tutorials/multiphase/vofLPTSolver/ACCM_bubbleCol3D/system/setFieldsDict
/*---------------------------------------------------------------------------*
Caelus 5.10
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 0
);


regions
(
    boxToCell
    {
        box (-0.075 0 -0.075) (0.075 0.45 0.075);
        fieldValues
        (
            volScalarFieldValue alpha1 1
        );
    }
);

// ************************************************************************* //
